dingkris63/stm32Prj/HARDWARE/LCD/lcd.c
#include "lcd.h"
#include "font.h"
#include "stdlib.h"
#include "stm32f4xx.h"
#include "usart.h"
//////////////////////////////////////////////////////////////////////////////////
// 本程序只供学习使用，未经作者许可，不得用于其它任何用途
// ALIENTEK STM32F407开发板
// 2.4寸/2.8寸/3.5寸/4.3寸/7寸 TFT液晶驱动
// 支持驱动IC型号包括:ILI9341/ILI9325/RM68042/RM68021/ILI9320/ILI9328/LGDP4531/LGDP4535/
//                   SPFD5408/1505/B505/C505/NT35310/NT35510/SSD1963等
// 正点原子@ALIENTEK
// 技术论坛:www.openedv.com
// 创建日期:2010/7/4
// 版本：V3.0
// 版权所有，盗版必究。
// Copyright(C) 广州市星翼电子科技有限公司 2014-2024
// All rights reserved
//********************************************************************************
// V1.2修改说明
// 支持了SPFD5408的驱动,另外把液晶ID直接打印成HEX格式.方便查看LCD驱动IC.
// V1.3
// 加入了快速IO的支持
// 修改了背光控制的极性（适用于V1.8及以后的开发板版本）
// 对于1.8版本之前(不包括1.8)的液晶模块,请修改LCD_Init函数的LCD_LED=1;为LCD_LED=1;
// V1.4
// 修改了LCD_ShowChar函数，使用画点功能画字符。
// 加入了横竖屏显示的支持
// V1.5 20110730
// 1,修改了B505液晶读颜色有误的bug.
// 2,修改了快速IO及横竖屏的设置方式.
// V1.6 20111116
// 1,加入对LGDP4535液晶的驱动支持
// V1.7 20120713
// 1,增加LCD_RD_DATA函数
// 2,增加对ILI9341的支持
// 3,增加ILI9325的独立驱动代码
// 4,增加LCD_Scan_Dir函数(慎重使用)
// 6,另外修改了部分原来的函数,以适应9341的操作
// V1.8 20120905
// 1,加入LCD重要参数设置结构体lcddev
// 2,加入LCD_Display_Dir函数,支持在线横竖屏切换
// V1.9 20120911
// 1,新增RM68042驱动（ID:6804），但是6804不支持横屏显示！！原因：改变扫描方式，
// 导致6804坐标设置失效，试过很多方法都不行，暂时无解。
// V2.0 20120924
// 在不硬件复位的情况下,ILI9341的ID读取会被误读成9300,修改LCD_Init,将无法识别
// 的情况（读到ID为9300/非法ID）,强制指定驱动IC为ILI9341，执行9341的初始化。
// V2.1 20120930
// 修正ILI9325读颜色的bug。
// V2.2 20121007
// 修正LCD_Scan_Dir的bug。
// V2.3 20130120
// 新增6804支持横屏显示
// V2.4 20131120
// 1,新增NT35310（ID:5310）驱动器的支持
// 2,新增LCD_Set_Window函数,用于设置窗口,对快速填充,比较有用,但是该函数在横屏时,不支持6804.
// V2.5 20140211
// 1,新增NT35510（ID:5510）驱动器的支持
// V2.6 20140504
// 1,新增ASCII 24*24字体的支持(更多字体用户可以自行添加)
// 2,修改部分函数参数,以支持MDK -O2优化
// 3,针对9341/35310/35510,写时间设置为最快,尽可能的提高速度
// 4,去掉了SSD1289的支持,因为1289实在是太慢了,读周期要1us...简直奇葩.不适合F4使用
// 5,修正68042及C505等IC的读颜色函数的bug.
// V2.7 20140710
// 1,修正LCD_Color_Fill函数的一个bug.
// 2,修正LCD_Scan_Dir函数的一个bug.
// V2.8 20140721
// 1,解决MDK使用-O2优化时LCD_ReadPoint函数读点失效的问题.
// 2,修正LCD_Scan_Dir横屏时设置的扫描方式显示不全的bug.
// V2.9 20141130
// 1,新增对SSD1963 LCD的支持.
// 2,新增LCD_SSD_BackLightSet函数
// 3,取消ILI93XX的Rxx寄存器定义
// V3.0 20150423
// 修改SSD1963 LCD屏的驱动参数.
//////////////////////////////////////////////////////////////////////////////////
static void Timer2_Init();
static void delay_ms(uint32_t ms);
static void delay_us(uint32_t us);

u16 PEN_COLOR = 0x0000; // 画笔颜色
u16 BG_COLOR = 0xFFFF;  // 背景色

//! important lcd data
_lcd_dev lcddev;

// Write Register
void LCD_WR_REG(vu16 regval) {
  regval = regval;       // insert this expression for delay if add -O2
  LCD->LCD_REG = regval; // Register ID
}

// Write LCD data
void LCD_WR_DATA(vu16 data) {
  data = data; // add this expression for delay if add -O2
  LCD->LCD_RAM = data;
}

// Read LCD Data
u16 LCD_RD_DATA(void) {
  vu16 ram; // __IO uint16_t
  ram = LCD->LCD_RAM;
  return ram;
}

// Write Register
// LCD_Reg: Register Address
// LCD_RegValue: Data
void LCD_WriteReg(u16 LCD_Reg, u16 LCD_RegValue) {
  LCD->LCD_REG = LCD_Reg;      // Register ID
  LCD->LCD_RAM = LCD_RegValue; // Data
}
// Read Register
// LCD_Reg: Register Address
// LCD_RegValue: Data
u16 LCD_ReadReg(u16 LCD_Reg) {
  LCD_WR_REG(LCD_Reg); // Register ID
  delay_us(5);
  return LCD_RD_DATA();
}
// 开始写GRAM
void LCD_WriteRAM_Prepare(void) { LCD->LCD_REG = lcddev.wramcmd; }
// LCD写GRAM
// RGB_Code:颜色值
void LCD_WriteRAM(u16 RGB_Code) {
  LCD->LCD_RAM = RGB_Code; // 写十六位GRAM
}
// 从ILI93xx读出的数据为GBR格式，而我们写入的时候为RGB格式。
// 通过该函数转换
// c:GBR格式的颜色值
// 返回值：RGB格式的颜色值
u16 LCD_BGR2RGB(u16 c) {
  u16 r, g, b, rgb;
  b = (c >> 0) & 0x1f;
  g = (c >> 5) & 0x3f;
  r = (c >> 11) & 0x1f;
  rgb = (b << 11) + (g << 5) + (r << 0);
  return (rgb);
}
// 当mdk -O1时间优化时需要设置
// 延时i
void opt_delay(u8 i) {
  while (i--)
    ;
}
// 读取个某点的颜色值
// x,y:坐标
// 返回值:此点的颜色
u16 LCD_ReadPoint(u16 x, u16 y) {
  u16 r = 0, g = 0, b = 0;
  if (x >= lcddev.width || y >= lcddev.height)
    return 0; // 超过了范围,直接返回
  LCD_SetCursor(x, y);
  if (lcddev.id == 0X9341 || lcddev.id == 0X6804 || lcddev.id == 0X5310 ||
      lcddev.id == 0X1963)
    LCD_WR_REG(0X2E); // 9341/6804/3510/1963 发送读GRAM指令
  else if (lcddev.id == 0X5510)
    LCD_WR_REG(0X2E00); // 5510 发送读GRAM指令
  else
    LCD_WR_REG(0X22); // 其他IC发送读GRAM指令
  if (lcddev.id == 0X9320)
    opt_delay(2);    // FOR 9320,延时2us
  r = LCD_RD_DATA(); // dummy Read
  if (lcddev.id == 0X1963)
    return r; // 1963直接读就可以
  opt_delay(2);
  r = LCD_RD_DATA(); // 实际坐标颜色
  if (lcddev.id == 0X9341 || lcddev.id == 0X5310 ||
      lcddev.id == 0X5510) // 9341/NT35310/NT35510要分2次读出
  {
    opt_delay(2);
    b = LCD_RD_DATA();
    g = r & 0XFF; // 对于9341/5310/5510,第一次读取的是RG的值,R在前,G在后,各占8位
    g <<= 8;
  }
  if (lcddev.id == 0X9325 || lcddev.id == 0X4535 || lcddev.id == 0X4531 ||
      lcddev.id == 0XB505 || lcddev.id == 0XC505)
    return r; // 这几种IC直接返回颜色值
  else if (lcddev.id == 0X9341 || lcddev.id == 0X5310 || lcddev.id == 0X5510)
    return (((r >> 11) << 11) | ((g >> 10) << 5) |
            (b >> 11)); // ILI9341/NT35310/NT35510需要公式转换一下
  else
    return LCD_BGR2RGB(r); // 其他IC
}
// LCD开启显示
void LCD_DisplayOn(void) {
  if (lcddev.id == 0X9341 || lcddev.id == 0X6804 || lcddev.id == 0X5310 ||
      lcddev.id == 0X1963)
    LCD_WR_REG(0X29); // 开启显示
  else if (lcddev.id == 0X5510)
    LCD_WR_REG(0X2900); // 开启显示
  else
    LCD_WriteReg(0X07, 0x0173); // 开启显示
}
// LCD关闭显示
void LCD_DisplayOff(void) {
  LCD_WR_REG(0X28); // 关闭显示
}
// 设置光标位置
// Xpos:横坐标
// Ypos:纵坐标
void LCD_SetCursor(u16 Xpos, u16 Ypos) {
  LCD_WR_REG(lcddev.setxcmd);
  LCD_WR_DATA(Xpos >> 8);
  LCD_WR_DATA(Xpos & 0XFF);
  LCD_WR_REG(lcddev.setycmd);
  LCD_WR_DATA(Ypos >> 8);
  LCD_WR_DATA(Ypos & 0XFF);
}
// 设置LCD的自动扫描方向
void LCD_Scan_Dir(u8 dir) {
  u16 regval = 0;
  u16 dirreg = 0;
  u16 temp;
  if (lcddev.dir == 1) {
    switch (dir) {
    case 0:
      dir = 6;
      break;
    case 1:
      dir = 7;
      break;
    case 2:
      dir = 4;
      break;
    case 3:
      dir = 5;
      break;
    case 4:
      dir = 1;
      break;
    case 5:
      dir = 0;
      break;
    case 6:
      dir = 3;
      break;
    case 7:
      dir = 2;
      break;
    }
  }

  switch (dir) {
  case L2R_U2D: // 从左到右,从上到下
    regval |= (0 << 7) | (0 << 6) | (0 << 5);
    break;
  case L2R_D2U: // 从左到右,从下到上
    regval |= (1 << 7) | (0 << 6) | (0 << 5);
    break;
  case R2L_U2D: // 从右到左,从上到下
    regval |= (0 << 7) | (1 << 6) | (0 << 5);
    break;
  case R2L_D2U: // 从右到左,从下到上
    regval |= (1 << 7) | (1 << 6) | (0 << 5);
    break;
  case U2D_L2R: // 从上到下,从左到右
    regval |= (0 << 7) | (0 << 6) | (1 << 5);
    break;
  case U2D_R2L: // 从上到下,从右到左
    regval |= (0 << 7) | (1 << 6) | (1 << 5);
    break;
  case D2U_L2R: // 从下到上,从左到右
    regval |= (1 << 7) | (0 << 6) | (1 << 5);
    break;
  case D2U_R2L: // 从下到上,从右到左
    regval |= (1 << 7) | (1 << 6) | (1 << 5);
    break;
  }

  dirreg = 0X36;

  LCD_WriteReg(dirreg, regval);

